Revit 2027 API
AssemblyInstance.GetMemberIds Method
 Gets member element ids for the assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetMemberIds()
Public Function GetMemberIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetMemberIds()
member GetMemberIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 Element ids for the members of the assembly instance.
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace